import "./AboutBazar.css"
import { useState } from 'react';

const AboutBazar = () => {

    const [showMore, setshowMore] = useState("200px")

    const handleClick = () => {
        if (showMore === "auto") {
            setshowMore("200px")

        } else {
            setshowMore("auto")
        }
    };

    return (
        <div className="about-bazar-container" >
            <p style={{ height: `${showMore}`, overflow: "hidden" }} >

                به خودتان نگاهی بیندازید، آیا برای انجام هر کاری به گوشی خود سر نمی‌زنید؟ آیا به‌دنبال <span style={{ fontWeight: 'bold' }}>دانلود برنامه های اندویدی</span>  نیستید که کارهایتان را آسان‌تر کنند؟ ما در بازار <span style={{ fontWeight: 'bold' }}>اپلیکیشن های اندروید</span>، برای هر موضوعی که در ذهن شماست، برنامه داریم و امکان نصب و دانلود آن‌ها را با اینترنت نیم‌بها و با سپر امنیت بازار برایتان فراهم کرده‌ایم.
                <br />
                اپلیکیشن‌های بازار در ۲۰ دسته‌ی مختلف منظم شده‌اند که در ادامه آن‌ها را برایتان معرفی می‌کنیم. کافی است موضوع مورد علاقه‌ی خود را انتخاب کنید و از بین صدها برنامه هر دسته، بهترین و کاربردی‌ترین اپ را که کاربران به برنامه‌ها داده‌اند نیز توجه کنید تا حافظه موبایل‌تان را با اپ‌های بهتری پر کنید.
                <h3>
                    دانلود برنامه‌های جدید اندرویدی
                </h3>
                در صفحه اصلی بازار می‌توانید برنامه‌های جدید منتخب سردبیران و همینطور بروزرسانی‌های منتخب را ببینید و از هیچ برنامه جدیدی جا نمانید. بازی‌های جدید نیز در صفحه بازی‌های اندرویدی بازار به‌همین ترتیب مشخص هستند.
                <h3>
                    برنامه‌های شبکه‌های اجتماعی
                </h3>

                امروز برای بسیاری از ما، گذران زندگی و کار بدون شبکه‌های اجتماعی امکان‌پذیر مثل واتساپ، اینستاگرام، تلگرام، توییتر، یوتیوب و ... نیست. هر برنامه‌ای که دوست دارید را انتخاب و ارتباط با جهان را آغاز کنید. جدیدترین بروزرسانی این اپ‌های بسیار پرطرفدار نیز به محض انتشار، در بازار قرار می‌گیرند و از طریق اطلاع‌رسانی‌ها (نوتیفیکیشن) شما را مطلع می‌کنند.
                <h3>
                    ابزارهای اندرویدی
                </h3>
                گوشی شما با برنامه‌های دسته‌ی ابزارهای بازار، آچار فرانسه‌ است. از ماشین حساب، زنگ، یادآور و تقویم گرفته تا ابزارهای افزایش سرعت گوشی، قفل برنامه‌ها، افزایش عمر باتری، ارزیابی سرعت و مصرف اینترنت، تبدیل واحدها، بارکد ساز و بارکدخوان، قطب‌نما، چراغ قوه، ساخت نسخه‌ی پشتیبان، دفتر یادداشت، آنتی ویروس‌ها، حافظه‌ی ابری و بسیاری برنامه‌ی پرکاربرد دیگر.
                <h3>
                    اپلیکیشن‌های عکاسی و ویدیو و فیلم‌برداری
                </h3>

                اگر دنبال برنامه‌هایی هستید که از گوشی خود بهتر و بیشتر استفاده کنید، به دسته‌های شخصی‌سازی و عکاسی و ویدیو سر بزنید. اپلیکیشن‌های تصاویر پس زمینه، قفل‌ها و برترین‌ برنامه‌های تغییر فضای گوشی را از دسته‌ی شخصی‌سازی نصب کنید. برنامه‌های ویرایش و ساخت عکس، ساخت ویدیو و چاپ عکس را نیز از دسته‌ي عکاسی و ویدیو دانلود کنید و دنیای فیلترها و ابزارهای تدوین را تجربه کنید.

                از ابزارهای شخصی‌سازی نیز غافل نشوید و گوشی خود را با آن‌ها، به سبک خود تغییر دهید. مثلا زنگ گوشی، پس زمینه و صفحه کلید شخصی خود را دانلود کنید و با قفل فایل‌ها و برنامه‌ها کنترل موبایل خود را به دست بگیرید.
                <h3>
                    برنامه‌های امور مالی
                </h3>

                حوزه‌ی سرمایه و پول هر روز در حال تغییر و پیشرفت است. دسته‌ی امور مالی برنامه‌های کاربردی‌ای مثل رمز پویا، روش‌های انتقال پول، همراه بانک‌ها، حسابداری شخصی تا برنامه‌های تحلیلی بازار بورس و سرمایه‌گذاری، فروش سهام عدالت، قوانین مالی و محاسبات حقوقی، محاسبه سود سپرده و وام را پوشش می‌دهد. همینطور با کمک برنامه‌های حسابداری شخصی، تحلیل بازار بورس و مالی می‌توانید سرمایه‌ خود را مدیریت کنید و دخل و خرج‌تان را محاسبه کنید.
                <h3>
                    اپ‌های آموزشی
                </h3>

                آموزش مجازی این روزها حرف اول را می‌زند. اپلیکیشن‌هایی که بتوانند سریع‌ترین و شیرین‌ترین روش یادگیری موضوعات مثل زبان انگلیسی، آشپزی، درس‌های از دبستان تا کنکور، برنامه‌نویسی و بسیاری موضوعات دیگر را در دسترس قرار دهند، بیشترین طرفدار را دارند. این دسته، دنیایی از اپلیکیشن‌هاست که می‌توانید با دانلود آن‌ها هر موضوعی را یاد بگیرید. معروف‌ترین و پرطرفدارترین برنامه این دسته هم اپلیکیشن شاد مدارس است که دانش‌آموزان علاقه زیادی به آن دارند.(!)
                <h3>
                    برنامه‌های موسیقی و صداگذاری
                </h3>

                برنامه‌های اندروید موسیقی، شما را به آخرین آلبوم‌ها و آهنگ‌های روز متصل می‌کند. با کمک این اپ‌ها می‌توانید پلی‌لیست‌ شخصی‌های خود را بسازید، روی ویدیوهای خود صدا بگذارید و اپلیکیشن‌های تغییر صدای مختلف را ببینید.

                آب و هوای دنیای آشپزی با دانلود اپلیکیشن‌های این دسته مزده‌دارتر می‌شود. برنامه‌های آشپزی بازار برای هرسلیقه‌‌ای با هر میزان دسترسی به مواد غذایی دستور غذایی دارد. آنلاین با گوشی اندروید هوشمند خود مواد غذایی و میوه بخرید. با دستورهای جدید، پخت و پز کنید. با برنامه‌های آشپزی و رستوران، رستوران‌های جدید را بشناسید، غذا سفارش دهید و رستوران‌گردی کنید.
                <h3>
                    اپلیکیشن‌های سبک زندگی

                </h3>
                هر فردی در طول روز برای بهتر و راحت‌تر زندگی کردن به برنامه‌های دسته‌ی سبک زندگی نیاز دارد. در دسته‌ی سبک زندگی می‌توانید برنامه‌های اندروید سلامت روان و خوشناسی را دانلود کنید؛ یا سری به برنامه‌های کاربردی بزنید و هر سرویس آنلاینی که در طول روز به آن نیاز دارید از خشکشویی تا تعمیرات خانه و طراحی داخلی را پیدا کنید.
            </p>

            <div className={showMore === "auto" ? "showless" : "showmore"} onClick={handleClick}>
                <svg xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 24 24" strokeWidth="1.5" stroke="currentColor" className="flash" >
                <path strokeLinecap="round" strokeLinejoin="round" d="M19.5 8.25l-7.5 7.5-7.5-7.5" />
            </svg>
            </div>
        </div >
    )
}


export default AboutBazar